let icon =  document.querySelector("header i.icon-header");
let ul = document.querySelector("header ul");
icon.onclick = function (){
    ul.classList.toggle("active");
    document.getElementsByClassName("close")[0].classList.add("active")
}
document.getElementsByClassName("close")[0].onclick = ()=>{
    ul.classList.remove("active");
}

document.getElementById("more").onclick=()=>{
    document.getElementById("more").style.display="none"
    console.log("kk")
    document.querySelectorAll(".Solution p")[0].innerHTML=`
    
    <span >
    حدائق المحيطات تواجه العديد من التهديدات التي تؤثر على استدامتها وتركيبتها البيئية. من بين هذه التهديدات:
</span> 
<br>

 1. *التلوث البحري:* تعرض حدائق المحيطات للتلوث الناجم عن النفايات البلاستيكية والزيوت والمواد الكيميائية والنفايات الصناعية. هذا التلوث يمكن أن يسبب تلفًا جسيمًا للشعاب المرجانية والكائنات البحرية.
<br>
2. *ارتفاع درجة حرارة المياه:* زيادة درجة حرارة مياه المحيطات بسبب التغير المناخي تؤدي إلى ظاهرة اصفرار الشعاب المرجانية وتبيضها، مما يؤدي إلى موت الشعاب المرجانية وتدهور البيئة البحرية.
<br>
3. *زيادة حموضة المحيطات:* امتصاص غاز ثاني أكسيد الكربون من الجو من قبل المحيطات يزيد من حموضتها، وهذا يؤثر على الكائنات البحرية التي تعتمد على تكوين معين للكالسيوم مثل الشعاب المرجانية.
<br>
4. *الصيد المفرط:* صيد الأسماك بشكل مفرط قد يؤدي إلى انخفاض أعداد الأسماك والكائنات البحرية الأخرى التي تعيش في حدائق المحيطات، مما يؤثر على توازن النظام البيئي.
<br>
5. *النفاذ الساحلي:* التنمية الساحلية والبنية التحتية البشرية تؤدي إلى النفاذ المباشر إلى حدائق المحيطات، مما يتسبب في تلويث المياه وتخريب المواقع البيئية.
<br>
6. *الجمع غير المستدام للزوجيات والأصداف:* تجارة غير مستدامة في الزوجيات والأصداف يمكن أن تضر بالأنواع والبيئة البحرية.
<br>
لحماية حدائق المحيطات، تتطلب الجهود الدولية والمحلية التعاون في تقليل هذه التهديدات وتنفيذ استراتيجيات للحفاظ على هذه البيئة البحرية الهامة وتعزيز استدامتها.
`
}